DataProcessors/ЛБ_ПроверкаЧастичныхСовпадений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ПроверкаЧастичныхСовпадений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ЧастичныеСовпаденияПоПеречням.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЧастичныеСовпаденияПоПеречням</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСовпадения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыЧастичныхСовпадений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрешено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрещено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникОбнаружил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникПроверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИВремяСовпадения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаСовпадения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ПроверкаЧастичныхСовпадений/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазрешить(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		ПроверкаПройдена = ПроверитьСтроку(ТекСтр, Истина, Ложь);
		
		Если ПроверкаПройдена Тогда
			РазрешитьЗапретитьНаСервере(ТекСтр, Истина, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапретить(Команда)
	ТекСтр = Элементы.Список.ТекущиеДанные;

	Если ТекСтр <> Неопределено Тогда
		ПроверкаПройдена = ПроверитьСтроку(ТекСтр, Ложь, Истина);
		
		Если ПроверкаПройдена Тогда
			РазрешитьЗапретитьНаСервере(ТекСтр, Ложь, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСтроку(ТекСтр, Разрешить, Запретить)

	ЕстьНовыеЗаписи = ПроверитьНаличиеНовыхЗаписей(ТекСтр);
	
	Если ЕстьНовыеЗаписи Тогда
		Сообщить("Есть более свежие записи. Подтверждение старых запрещено!");
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекСтр.Разрешено И Разрешить Тогда
		Сообщить("Разрешение усже установлено");
		Возврат Ложь;
	КонецЕсли;

	Если ТекСтр.Запрещено И Запретить Тогда
		Сообщить("Запрет усже установлен");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПроверитьНаличиеНовыхЗаписей(ТекСтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.Период КАК Период,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.Залогодатель КАК Залогодатель
		|ИЗ
		|	РегистрСведений.ЛБ_ЧастичныеСовпаденияПоПеречням.СрезПервых(
		|			&Дата,
		|			Залогодатель = &Залогодатель
		|				И ВидСовпадения = &ВидСовпадения) КАК ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых
		//|				И ВидПеречня = &ВидПеречня) КАК ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", ТекСтр.Период + 1);
	//Запрос.УстановитьПараметр("ВидПеречня", ТекСтр.ВидПеречня);
	Запрос.УстановитьПараметр("ВидСовпадения", ТекСтр.ВидСовпадения);
	Запрос.УстановитьПараметр("Залогодатель", ТекСтр.Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура РазрешитьЗапретитьНаСервере(ТекСтр, Разрешить, Запретить)

	НаборЗаписей = РегистрыСведений.ЛБ_ЧастичныеСовпаденияПоПеречням.СоздатьНаборЗаписей();
	НаваяЗапись = НаборЗаписей.Добавить();
	НаваяЗапись.Период = ТекущаяДата();
	НаваяЗапись.Залогодатель = ТекСтр.Залогодатель;
	НаваяЗапись.ВидСовпадения = ТекСтр.ВидСовпадения;
	//НаваяЗапись.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ПустаяСсылка(); //ТекСтр.ВидПеречня;
	НаваяЗапись.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
	НаваяЗапись.ТребуетПроверки = Ложь;
	НаваяЗапись.Разрешено = Разрешить;
	НаваяЗапись.Запрещено = Запретить;
	НаваяЗапись.СотрудникОбнаружил = ТекСтр.СотрудникОбнаружил;
	НаваяЗапись.СотрудникПроверил = ПараметрыСеанса.ТекущийСотрудник;
	
	Если ТекСтр.ДатаИВремяСовпадения = Дата(1,1,1) Тогда
		НаваяЗапись.ДатаИВремяСовпадения = ТекСтр.Период;
	Иначе
		НаваяЗапись.ДатаИВремяСовпадения = ТекСтр.ДатаИВремяСовпадения;
	КонецЕсли;
	
	НаваяЗапись.Фамилия = ТекСтр.Залогодатель.Фамилия;
	НаваяЗапись.Имя = ТекСтр.Залогодатель.Имя;
	НаваяЗапись.Отчество = ТекСтр.Залогодатель.Отчество;
	НаваяЗапись.СтрокаСовпадения = "";
	
	НаборЗаписей.Записать(Ложь);
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтр = Элементы.Список.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		ЗначениеОтбора = Новый Структура;
		ЗначениеОтбора.Вставить("Залогодатель", ТекСтр.Залогодатель);
		//ЗначениеОтбора.Вставить("ВидСовпадения", ТекСтр.ВидСовпадения);
		
		ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("ВидСовпадения", ТекСтр.ВидСовпадения); 
		//ПараметрыФормы.Вставить("Запрещено", ТекСтр.Запрещено); 
		//ПараметрыФормы.Вставить("Имя", ТекСтр.Имя);
		//ПараметрыФормы.Вставить("Залогодатель", ТекСтр.Залогодатель);
		//ПараметрыФормы.Вставить("Ломбард", ТекСтр.Ломбард);
		//ПараметрыФормы.Вставить("Отчество", ТекСтр.Отчество);
		//ПараметрыФормы.Вставить("ДатаВыбраннойЗаписи", ТекСтр.Период);
		//ПараметрыФормы.Вставить("ДатаИВремяСовпадения", ТекСтр.ДатаИВремяСовпадения);
		//ПараметрыФормы.Вставить("Разрешено", ТекСтр.Разрешено);
		//ПараметрыФормы.Вставить("СотрудникОбнаружил", ТекСтр.СотрудникОбнаружил);
		//ПараметрыФормы.Вставить("СотрудникПроверил", ТекСтр.СотрудникПроверил);
		//ПараметрыФормы.Вставить("ТребуетПроверки", ТекСтр.ТребуетПроверки);
		//ПараметрыФормы.Вставить("Фамилия", ТекСтр.Фамилия);
		ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
		
		ОткрытьФорму("Обработка.ЛБ_ПроверкаЧастичныхСовпадений.Форма.ФормаДетальныйПросмотр", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры
